; domain
(define
  (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:constants S T A R H C U K - block)
  (:predicates (on ?x ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block) (obs_0) (obs_1))
  (:action pick-up :parameters (?x - block) :precondition (and (clear ?x) (ontable ?x) (handempty)) :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))
  (:action put-down :parameters (?x - block) :precondition (holding ?x) :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))
  (:action stack :parameters (?x ?y - block) :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y))) :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))
  (:action unstack :parameters (?x ?y - block) :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y))) :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))
  (:action unstack__obs1 :parameters () :precondition (and (on s a) (clear s) (handempty) (not (= s a)) (obs_0)) :effect (and (holding s) (clear a) (not (clear s)) (not (handempty)) (not (on s a)) (obs_1)))
)

; problem
(define
  (problem blocks_words)
  (:domain blocks)
  (:objects)
  (:init (HANDEMPTY) (CLEAR T) (ONTABLE T) (CLEAR U) (ONTABLE U) (CLEAR R) (ONTABLE R) (CLEAR K) (ONTABLE K) (CLEAR C) (ONTABLE C) (CLEAR S) (ON S A) (ON A H) (ONTABLE H) (obs_0))
  (:goal (and (CLEAR S) (ONTABLE R) (ON S T) (ON T A) (ON A R) (obs_1)))
)

; plan
1. (unstack__obs1)
   deleted: (clear s) (handempty) (on s a)
   added: (holding s) (clear a) (obs_1)
   goals met: 2 of 6
2. (stack s c)
   deleted: (holding s) (clear c)
   added: (clear s) (handempty) (on s c)
   goals met: 3 of 6
3. (unstack a h)
   deleted: (clear a) (handempty) (on a h)
   added: (holding a) (clear h)
   goals met: 3 of 6
4. (stack a r)
   deleted: (holding a) (clear r)
   added: (clear a) (handempty) (on a r)
   goals met: 4 of 6
5. (pick-up t)
   deleted: (ontable t) (clear t) (handempty)
   added: (holding t)
   goals met: 4 of 6
6. (stack t a)
   deleted: (holding t) (clear a)
   added: (clear t) (handempty) (on t a)
   goals met: 5 of 6
7. (unstack s c)
   deleted: (clear s) (handempty) (on s c)
   added: (holding s) (clear c)
   goals met: 4 of 6
8. (stack s t)
   deleted: (holding s) (clear t)
   added: (clear s) (handempty) (on s t)
   goals met: 6 of 6
